{
  "AI Engineer - Internship-SaharHarati (1).pdf": "Sahar Harati\nProspective Machine learning-Vision Engineer\nForchheim, Germany — sahar.harati1999@gmail.com — +39 351 61 45678\nLinkedIn — GitHub — LeetCode\nSummary\nI am a passionate master student in Computer science,driven by a deep curiosity for exploring how AI can advance scientific\nunderstanding and, ultimately, improve people’s lives. My journey has taken me to ML model development and computational\nvision. I hope to contribute to bridging research with real-world applications in AI-driven human modeling.\nSkills\nMachine Learning & AI: Deep Learning, Supervised & Unsupervised Learning, Neural Networks, Transformer Models,\nGenerative Adversarial Networks (GANs)\nProgramming: Python, SQL, PL/SQL, C++\nLibraries: NumPy, Pandas, Scikit-Learn, PyTorch, TensorFlow, Keras, OpenCV, Matplotlib\nData Processing & Engineering: ETL, Data Modeling, Data Warehousing, Relational Database\nGeneral: Image Processing, Unity, Git, Linux, Docker, Power BI\nSoft Skills: Problem-solving, Collaboration, Communication, Research, Adaptability, Innovation, Self-Motivation\nLanguages: English (C1), Persian (C2), Italian (B1), German (A2)\nExperience\nBusiness Intelligence Intern Jun 2021 – Dec 2021\nCASPCO, Tehran, Iran\n•Developed ETL pipelines for data integration and transformation and streamline data warehouse operations.\n•Created real time analytics dashboards and reports using Power BI, resulting more informed decision-making for the\nmanagement team using SQL, PL/SQL and python.\nTeaching Assistant Feb 2021 – May 2021\nShahrood University of Technology, Iran\n•Mentored students in Python and C++ programming, focusing on data structures and algorithmic problem-solving.\nProjects\nFatal Error detection My current project, working on ultrasound images of different fetal planes data sets, using transformer\nmodels and CNN and data augmentation techniques to implement the SonoNet and Evaluation of deep convolutional neural\nnetworks for automatic classification of common maternal fetal ultrasound planes, papers.\nMarker-less AR Turtle Logo Developed an AR-based interactive turtle logo in Unity using AR Foundation and Google AR\nCore XR Plugin, tested in Unity Play Mode.\nBreast Cancer Detection\nETL Pipeline Development: Built and optimized scalable data pipelines for data transformation and integration.\nData Engineering for Marketing Analytics: Developed ETL workflows to analyze customer behavior.\nParallel Mandelbrot Set: Optimized computations for HPC-based performance scaling\nStudy of Protein Language Models How the NLP models and LLMs are deployed to analysis the biological units.\nEducation\nMSc in Computer Science (Data science and engineering - Artificial Intelligence) Sep 2022 – Present\nUniversity of Genoa Genoa, Italy\nCourses: Machine Learning, Natural Language Processing, Data Visualization, High-Performance Computing, Augmented\nReality, IT Project management, Computational Vision.\nBSc in Computer Engineering 2018 – 2022\nShahrood University of Technology Shahrood, Iran\nThesis: Municipality call center BI dashboard for improved data-driven decision-making.\nHonors and Certificates\nDeep Learning & Neural Networks with Keras – Coursera, 2024\nMathematics for Machine Learning – Coursera, 2023\nKhwarizmi Yonkers Festival 1st Place in 2014 and 2nd Place in 2013 in Robotics\nReferences\nAvailable upon request.\n",
  "Sahar Harati.pdf": "Sahar Harati\nJunior Data Engineer — Forchheim, Germany\nUniversity Email — Gmail — +39 351 61 45678 LinkedIn — GitHub — LeetCode\nSummary\nAI Master’s student with strong experience in machine learning, deep learning, and data analysis. Passionate about re-\nsearch, explainable AI, and interdisciplinary applications. Eager to contribute to innovative projects and explore research\nopportunities in academic or applied settings.\nSkills\nProgramming: Python, C++, SQL, PL/SQL\nData Engineering: ETL, Data Modeling, Warehousing, Airflow, PostgreSQL, Docker, AWS S3 & Lambda\nData Science: Pandas, NumPy, Scikit-learn, Power BI, Matplotlib\nCloud & Tools: AWS (S3, EC2, Lambda), Databricks (basic), Git, Linux, Jupyter Notebook\nLanguages : English (C1), Persian (C2), Italian (B1), German (A2)\nEducation\nMSc in Computer Science (Data Science & AI) Sep 2022 – Present\nUniversity of Genoa Genoa, Italy\nRelevant Courses: Machine Learning, Deep Learning, Computer Vision, Natural Language Processing, Multi-Agent Systems,\nHigh-Performance Computing, Data Visualization\nBSc in Computer Engineering 2018 – 2022\nShahrood University of Technology Shahrood, Iran\nThesis: BI dashboard of the municipal call center for AI-driven decision-making to increase data accessibility.\nExperience\nBusiness Intelligence Intern Jun 2021 – Dec 2021\nCASPCO Tehran, Iran\n•Developed ETL pipelines for 500K+ records, improving data processing efficiency by 30%.\n•Designed Power BI dashboards, reducing report generation time by 40%.\n•Assisted in AI-driven data processing and predictive modeling for business applications.\nTeaching Assistant Feb 2021 – May 2021\nShahrood University of Technology Shahrood, Iran\n•Mentored students in Python, machine learning, and scientific computing techniques.\nProjects\nAirflow Automation of ETL(in progress) Created an Airflow DAG to automae the OpenAI ETL pipeline. Configured\nPythonOperator and scheduling to run workflows automatically.\nOpenAI API ETL Pipeline Built an ETL pipeline in Python to collect, transform, and store OpenAI prompt-response\npairs. Used ’.env’ and pandas for secure and structured data handling. Saved outputs to CSV for further NLP analysis.\nGitHub repo\nMunicipality Call Center BI Dashboard Processed 100K+ records with ETL pipelines and real-time analytics. Developed\ninteractive visualizations, improving data-driven decision-making by 30%.\nMarketing Analytics Data Engineering Built ETL workflows and dashboards to analyze customer behavior patterns.\nImplemented data transformations for business intelligence insights.\nParallel Mandelbrot Set Optimization (HPC) Accelerated fractal computations using parallel processing techniques.\nImproved execution speed by 75% with CUDA-based optimizations.\nHonors\nComputer Vision – Kaggle, 2025\nDeep Learning with Keras – Coursera, 2024\nMathematics for Machine Learning – Coursera, 2023\n1st & 2nd Place in Robotics, Khwarizmi Yonkers Festival, 2014 and 2013\n"
}
